webapp/app/Controllers/Consulta_controller.php

INSERT INTO `consulta` (`nombre`, `email`, `motivo`, `descripcion`) VALUES ('h', '', '1', '')
---
    public function enviar_consulta()
    {
        $consultaModel = new Consulta_model();
        $nombre = $_POST['nombre'];
        $email = $_POST['email'];
        $motivo = $_POST['motivo'];
        $descripcion = $_POST['descripcion'];

        $data = [
            'nombre' => $nombre,
            'email' => $email,
            'motivo' => $motivo,
            'descripcion' => $descripcion
        ];

        $consultaModel->insert($data);